Repository: mozilla-l10n/mt-training-data
Catalog: ha/ha_pontoon.tmx
Source language: en_us
Languages: ha

source: Streaks
ha: Tafiya

source: Submit
ha: Mika

source: Submit a report
ha: Mika rahoto

source: Submit clips
ha: Shigar da Clips

source: Subscribe
ha: Saka kanka

source: Success
ha: Nasara

source: Success, profile created!
ha: Anyi Nasarar ƙirƙiri profile dinka.

source: Swahili
ha: Yaren Swahili

source: Swedish
ha: Yaren Swedin

source: Syriac
ha: Yaren Syriac

source: Tagalog
ha: Yaren Tagalog

source: Tajik
ha: Yaren Tajik

source: Tamil
ha: Yaran Tamil

source: Tap
ha: Shafa

source: Tatar
ha: Yaren Tatar

source: Tatoeba is a large database of sentences, translations, and spoken audio for use in language learning. This download contains spoken English recorded by their community.
ha: Tatoeba babban tarin bayanai ne na jimloli, fassarori, da sautin magana don amfani dashi a cikin koyon yare. Wannan zazzagewa yana ɗauke da Ingilishi da ake magana da shi wanda al'ummarsu suka rubuta.

source: Telugu
ha: Telugunci

source: Terms
ha: Sharuɗɗa

source: Thai
ha: Yaren Thai

source: Thanks for confirming your account, now let's build your profile.
ha: Mungode da ka tabbatar mana da account ɗinka, yanzu bari mu gina profile ɗinka.

source: Thanks to contributions from over 259k people in over 50 languages, this data is being used to train speech-enabled applications to better respond to the human voice.
ha: Godiya ga gudummawa daga mutane sama da 259k a cikin sama da harsuna 50, ana amfani da wannan bayanan don horar da aikace-aikacen da aka kunna don magana mafi kyau ga muryar ɗan adam.

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
ha: Na gode da yin rikodi! <lineBreak> </lineBreak> Yanzu sake nazarin ku gabatar da shirye-shiryen ku a ƙasa.

source: Thank you for your interest in contributing to { $lang }. We work hard to get every language ready for launch and keep the teams updated via email. If you want to contribute, please provide your email below.
ha: Mun gode da nuna sha'awarka wajen taimaka wa yaren { $lang }. Muna aiki tukuru don samun kowane harshe a shirye tsaf kuma za mu ci gaba da tuntubar ma'abotanmu ta hanyar sakon yanar gizo. Idan kana son taimakawa, ka taimaka ka ba da adreshinka na yanar gizo a kasa.

source: The Clip Graveyard consists of voice clips that didn't make it into the Common Voice dataset. Just like the dataset, the Clip Graveyard is available for download.
ha: Makabartar Clip ta ƙunshi shirye-shiryen bidiyo waɗanda ba su sanya su cikin tsarin tattara bayanai na Murya ba. Kamar dataset, akwai Makabartar Clip don zazzagewa.

source: The clip has disrespectful or offensive language.
ha: Jumlar tana da maganganu na rashin ladabi ko na cin mutunci.

source: The Common Voice dataset complements Mozilla’s open source voice recognition engine Deep Speech. The first version of Deep Speech was released in November 2017 and has continued to evolve ever since. Together with the Common Voice dataset, we believe this open source voice recognition technology should be available to everybody. It’s our hope these technologies will enable developers to build a wave of innovative products and services.
ha: Bayanin Common Voice ya cika injin buɗe muryar muryar Mozilla Deep Speech. An saki sigar farko ta Deep Speech a waCommon Voice, munyi imanin cewa wannan fasahar buɗe murfin ya kamata ta kasance ga kowa. Muna fatan waɗannan fasahohin za su ba masu haɓaka damar ƙirƙirar samfuran samfuran zamani da sabis.

source: The Common Voice dataset complements Mozilla’s open source voice recognition engine Deep Speech, which you can use to build speech recognition applications. Read our <githubLink>Github overview</githubLink> or join the <discourseLink>DeepSpeech Discourse</discourseLink> to learn how to get started.
ha: Tasirin bayanan gama gari ya cika injin buɗe muryar buɗe ido na Mozilla Deep Speech, wanda zaku iya amfani dashi don gina aikace-aikacen gane magana. Karanta mu <githubLink> Github overview </githubLink> ko shiga cikin <discourseLink> Bayanin DeepSpeech </discourseLink> don koyon yadda ake farawa.

source: The Common Voice Dataset contains hundreds of thousands of voice samples that help developers build voice recognition tools.
ha: Dataset naCommon Voice ya ƙunshi ɗaruruwan dubunnan samfuran murya waɗanda ke taimaka wa masu haɓakawa ƙirƙirar kayan aikin gane murya.

source: The Common Voice dataset is an open and publicly available resource that can be used to train a wide variety of speech-enabled applications. To protect the security of our contributors, we ask everyone who downloads the Common Voice dataset to respect contributors’ privacy. All voice clips in the dataset are scrubbed of personally identifying information. When you download the dataset, you agree to not attempt to determine the identity of any contributor. That means you cannot try to link information in the dataset to a contributor’s personal information. You may, however, use the dataset to train speech recognition, speaker recognition, or other applications, by, for instance, linking information in the dataset to other information already in the dataset.
ha: Tasirin bayanan Common Voice a bayyane wuri ne kuma a bayyane wanda za'a iya amfani dashi don horar da nau'ikan aikace-aikacen da suka dace da magana. Don kare tsaron masu ba da gudummawarmu, muna tambayar duk wanda ya zazzage bayanan Common Voice don girmama sirrin masu bayar da gudummawa.¶ ¶ Duk shirye-shiryen bidiyo a cikin bayanan an goge bayanan ganowa da kaina. Lokacin da kuka zazzage bayanan, kun yarda da ba ƙoƙari don tantance asalin kowane mai ba da gudummawa ba. Wannan yana nufin ba za ku iya ƙoƙarin haɗa bayanin a cikin dataset ɗin ba ga keɓaɓɓen bayanan mai bayarwa. Duk da haka, kuna iya amfani da bayanan don horar da fitowar magana, fitowar mai magana, ko wasu aikace-aikace, ta misali, danganta bayanai a cikin bayanan zuwa wasu bayanan da suke a wurin.

source: The Common Voice dataset is available for download under the <licenseLink>CC0</licenseLink> license on <datasetLink>our Datasets page</datasetLink>. You can also download several other publicly available datasets from the same page.
ha: Ana samun kundin bayanan Common Voice don zazzagewa a ƙarƙashin lasisin <licenseLink> CC0 </licenseLink> akan <datasetLink> shafin Bayanai na Datasets ɗinmu </datasetLink>. Hakanan zaka iya zazzage wasu tarin bayanan da ake samu a fili daga wannan shafin.

source: The count of voice recording hours that have been validated by 2 out of 3 users with a vote of “Yes”. These mark progress toward the overall project 10k hours goal.
ha: Kididdigar awannin rikodin murya waɗanda masu amfani 2 cikin 3 suka inganta tare da ƙuri'ar “Ee”. Wadannan alamun ci gaba ne zuwa ga aikin gaba daya burin 10k.

source: The count of voice recording hours we have collected so far.
ha: Ƙidayar sa'o'in da muka naɗa na sauti kawo yanzu.

source: The goal of the Common Voice dataset is to enable anyone in the world to build speech recognition, speaker recognition, or any other type of application that requires voice data. A voice assistant is just one of many types of applications you could use the dataset to build.
ha: Manufar kundin Common Voice shine don bawa kowa a duniya damar gina ganewar magana, fitowar mai magana, ko kowane irin aikace-aikacen da ke buƙatar bayanan murya. Mataimakin murya ɗaya ne daga cikin nau'ikan aikace-aikace da yawa da zaku iya amfani da bayanan don ginawa.

source: The multi-language version of the Common Voice dataset is currently undergoing community supported bundling and cleaning. If you would like to help us bring Common Voice to new languages, go check out the <sentenceCollectorLink>Sentence Collection Tool</sentenceCollectorLink> for adding new sentences to the dataset, and Mozilla <pontoonLink>Pontoon</pontoonLink> for translating the website itself. New languages are added to Common Voice for voice contribution when 5000 approved sentences have been collected.
ha: Tsarin harsuna da yawa na dataset na Common Voice yanzu yana fuskantar tarin tallafi da tsaftacewa na al'umma. Idan kuna son taimaka mana kawo Voice na gama gari zuwa sababbin harsuna, je duba kayan <SentenceCollectorLink> Sentence Collection Tool </sentenceCollectorLink> don ƙara sabbin jumloli a cikin dataset, da Mozilla <pontoonLink> Pontoon </pontoonLink> don fassara gidan yanar gizon kanta. Ana ƙara sababbin harsuna zuwa Common Voice don gudummawar 5000 murya lokacin da aka tara da aka tattaro.

source: The number of recordings and which languages you contribute to will be public.
ha: Adadin rikodin da wani yare da ka bayar zai kasance ga dukkan jama'a.

source: The process by which a contributor’s profile information is obscured from their donated voice clips when packaged for download as a part of the dataset.
ha: Tsarin da aka ɓoye bayanan bayanan mai bayarwa daga shirye-shiryen muryar da aka bayar lokacin da aka shirya su don zazzagewa a matsayin ɓangare na dataset.

source: The recording was too long.
ha: Naɗin yai tsawo da yawa

source: The recording was too quiet.
ha: Naɗin yai shiru da yawa.

source: The recording was too short.
ha: Rikodin yayi kadan sosai.

source: These languages are currently under community development. The progress bars indicate how far each language is in the process of <localizationGlossaryLink>website localization</localizationGlossaryLink> and <sentenceCollectionGlossaryLink>sentence collection</sentenceCollectionGlossaryLink>.
ha: Waɗannan harsunan a halin yanzu suna ƙarƙashin ci gaban al'umma. Sandunan ci gaba suna nuna yadda kowane harshe yake a cikin aiwatarwar <localizationGlossaryLink> rubutun yanar gizo </localizationGlossaryLink> da <sentenceCollectionGlossaryLink> tarin magana </sentenceCollectionGlossaryLink>.

source: The selected file is too large
ha: Fayil ɗin da aka zaɓa ya yi girma sosai

source: The sentence has a grammatical or spelling error.
ha: Jumlar tana da lamuran nahawu ko kuskure.

source: The sentence has disrespectful or offensive language.
ha: Jumlar tana da maganganu na rashin ladabi ko na cin mutunci.

source: The site will be back up as soon as possible. For the latest information, please join the <matrixLink>Matrix community chat</matrixLink> or visit <githubLink>GitHub</githubLink> or <discourseLink>our Discourse forums</discourseLink> to submit and monitor site experience issues.
ha: Shafin zai dawo da wuri-wuri. Don sabon bayani, Don Allah shiga cikin <matrixLink> Matrix na tattaunawa ta gari </ matrixLink> ko ziyarci <githubLink> GitHub </githubLink> ko <discourseLink> tattaunawar mu na Tattaunawa </discourseLink> don ƙaddamarwa da lura da al'amuran ƙwarewar shafin.

source: The TED-LIUM corpus was made from audio talks and their transcriptions available on the TED website.
ha: TED-LIUM corpus an yi shi ne daga tattaunawar sauti da rubuce rubucensu da ke kan shafin yanar gizon TED.

source: This is approximately the number of hours required to train a production speech-to-text system.
ha: Wannan kusan adadin awannin da ake buƙata don horar da tsarin kera magana-zuwa-rubutu.

source: This is a use case driven segment containing data to power spoken digit recognition and yes / no detection.
ha: Wannan ɓangare ne wanda ake korafin amfani da shi wanda yake ɗauke da bayanai zuwa karfin magana da lambar magana da kuma eh/a'a ganowa.

source: This is open source software which can be freely remixed, extended, and improved. Mycroft may be used in anything from a science project to an enterprise software application.
ha: Wannan kayan aiki ne na buɗewa wanda za'a iya haɗe su, a faɗaɗa su, kuma a inganta su. Ana iya amfani da Mycroft a cikin komai daga aikin kimiyya zuwa aikace-aikacen software na kamfani.

source: This is our process for translating and adapting our content for many locales (languages).
ha: Wannan aikinmu ne don fassara da daidaita abubuwan da muke ciki don yankuna da yawa (harsuna).

source: This setting controls your leaderboard visibility. When hidden, your progress will be private. This means your image, user name and progress will not appear on the leaderboard. Note that leaderboard refresh takes ~{ $minutes }min to populate changes.
ha: Wannan saitin yana sarrafa ikon gani. Lokacin da aka ɓoye, ci gaban ku zai zama na sirri. Wannan yana nufin hotonku, sunan mai amfani da ci gaba ba zai bayyana akan jagorar ba. Lura cewa shayarwar jagora tana ɗaukar ~ { $mintuna } mintuna don yin canje-canje.

source: Three to go!
ha: Saura uku ka gama!

source: Today
ha: Yau

source: Today's Common Voice progress on clips recorded
ha: Ci gaban Common Voice a yau akan shirye-shiryen bidiyo da aka yi rikodin

source: Today's Common Voice progress on clips validated
ha: Ci gaban Common Voice a yau akan shirye-shiryen bidiyo da aka sami ingancinsa

source: Today's Progress
ha: Cigaban da aka samu yau

source: To make it into the Common Voice dataset, a voice clip must be validated by two separate users.
ha: Don sanya shi a cikin kundin tsarin Common Voice, dole ne a sami ingantaccen shirin murya ta masu amfani daban biyu.

source: To make the Common Voice dataset as useful as possible we have decided to only allow source text that is available under a Creative Commons (CC0) license. Using the CC0 standard means its more difficult to find and collect source text, but allows anyone to use the resulting voice data without usage restrictions or authorization from Mozilla. Ultimately, we want to make the multi-language dataset as useful as possible to everyone, including researchers, universities, startups, governments, social purpose organizations, and hobbyists.
ha: Don sanya kundin bayanan Common Voice ya zama mai amfani kamar yadda ya yiwu mun yanke shawarar kyale matanin tushe kawai wanda ke samuwa a karkashin lasisin Creative Commons (CC0). Amfani da mizanin CC0 yana nufin mafi wahalar samu da tattara rubutun tushe, amma yana bawa kowa damar amfani da bayanan muryar da aka samu ba tare da takurawar amfani ko izini daga Mozilla ba. Daga qarshe, muna son sanya kundin bayanan harsuna masu amfani yadda ya kamata ga kowa da kowa, gami da masu bincike, jami'oi, farawa, gwamnatoci, kungiyoyin manufar al'umma, da masu sha'awar sha'awa.

source: Top Contributors
ha: Waɗanda suka fi bada gudummawa

source: Total
ha: Jimilla

source: Total Approved
ha: Jimillar da aka amince

source: { $totalHours } hours is achievable in just over { $periodMonths } months if { $people } people record { $clipsPerDay } clips a day.
ha: { $totalHours } awanni ana samun nasara cikin sama da watanni{ $periodMonths } watanni idan { $people } mutane rikodi { $clipsPerDay } shirye-shiryen bidiyo a rana.

source: To the right we outline the benefits and clarify what information we make public. Use the links below to get started with a Common Voice account on your own device.
ha: A hannun dama muna bayyana fa'idodi kuma muna bayyana irin bayanan da muke gabatarwa ga jama'a. Yi amfani da hanyoyin da ke ƙasa don farawa tare da asusun Common Voice akan na'urarka.

source: Toward next goal
ha: Zuwa burin gaba

source: Track progress here and on your stats page.
ha: Bi sawun ci gaba a nan da kan shafin stats ɗinku.

source: Turkish
ha: Yaren Turkish

source: Ubykh
ha: Yaren Ubykh

source: Udmurt
ha: Yaren Udmurt

source: Ukrainian
ha: Yaran Yukreniya

source: Unable to speak right now?
ha: Ba za ka iya magana ba a yanzu?

source: UPLOAD
ha: Ɗaura

source: Upload aborted. Do you want to delete your recordings?
ha: An zubar da lodi. Shin kana son share abubuwan da kuka yi rakodi?

source: Upload an image file
ha: Ɗora hoto.

source: Urdu
ha: Urdanci

source: User Name
ha: Sunan mai Amfani

source: Users validate the accuracy of donated clips, checking that the speaker read the sentence correctly.
ha: Masu amfani suna tabbatar da daidaitattun shirye-shiryen bidiyo, suna bincika cewa mai magana ya karanta jumlar daidai.

source: Using Common Voice
ha: Amfani da Common Voice

source: Uzbek
ha: Yaren Uzbek

source: Validated Clips
ha: Naɗe-naɗen da aka tabbatar

source: Validated Hours
ha: Sa'o'in da aka tantance

source: Validated Hrs
ha: Awannin da aka tantance

source: Validated Hr. Total
ha: Inganta Hr. Jimla

source: Validating donated clips is equally important to the Common Voice mission. Take a listen and help us create quality open source voice data.
ha: Tabbatar da kyautatuwar sautikan da aka bada gudummawarsu na cikin muhimman ayyukan Common Voice. Saurari sautikan domin ka taimaka mana wajen samar da bayanai na muryoyi mai inganci.

source: Validations
ha: Tabbatarwa

source: Venetian
ha: Yaren Venetian

source: Version
ha: Nau'i

source: Vietnamese
ha: Yaren Vietnamese

source: View your progress against personal and project goals.
ha: Duba cigabanku kan burin naku da kanku da kuma na tsare-tsare

source: Visible
ha: A bayyane

source: Voice clips are entered into a submission queue that readies them for listening.
ha: Ana shigar da shirye-shiryen murya cikin layin sallama wanda zai iya karanta su don sauraro.

source: Voice Dataset, Ready for Download
ha: Sashin murya, Shirya don Saukewa

source: Voice is natural, voice is human. That’s why we’re excited about creating usable voice technology for our machines. But to create voice systems, developers need an extremely large amount of voice data.
ha: Murya wani abu ne na asali kuma mutane kan yi. Wannan ne ya sa muke sha'awar samar da fasahar murya ga nau'rorinmu. Sai dai kafin mu samar da wannan fasahar, muna buƙatar bayanai na muryoyi masu matuƙar yawa.

source: Voice is natural, voice is human. That’s why we’re fascinated with creating usable voice technology for our machines. But to create voice systems, an extremely large amount of voice data is required.
ha: Murya wani abu ne na asali kuma mutane kan yi. Wannan ne ya sa muke sha'awar samar da fasahar murya ga injunanmu. Sai dai kafin mu samar da wannan fasahar, dole mu samu bayanai na muryoyi masu yawa.

source: Voice recognition technology is revolutionizing the way we interact with machines, but the currently available systems are expensive and proprietary. Common Voice is part of Mozilla’s initiative to make voice recognition technologies better and more accessible for everyone. Common Voice is a massive global database of donated voices that lets anyone quickly and easily train voice-enabled apps in potentially every language. We're not only collecting voice samples in widely spoken languages but also in those with a smaller population of speakers. Publishing a diverse dataset of voices will empower developers, entrepreneurs, and communities to address this gap themselves. In addition to the Common Voice dataset, we’re also building an open source speech recognition engine called Deep Speech.
ha: Fasahar Magana wani juyin-juya hali ne da zai sauya yadda muke ma'amala da na'ura, amma kimiyyar da muke da su yanzu suna da tsada kuma na neman kuɗi ne. Common voice na daga cikin Ayyukan sa kai na Mozilla don samar da fasahar murya mai inganci kuma sauƙaƙƙa ga kowa, Common Voice wani babban ma'ajiya ta tattara muryoyin da aka ba da gudun mowa kuma a ba ka damar horar da vurya ko sawa cikin manhajarka da kowanne yare

source: Voice recording in progress
ha: Ɗaukan murya na kan cingaba

source: Voices Online Now
ha: Muryoyin da suke a kan yanar gizo

source: Votic
ha: Yaran Votic

source: VoxForge was set up to collect transcribed speech for use with Free and Open Source Speech Recognition Engines.
ha: An kafa VoxForge don tattara maganganun da aka kwafa don amfani tare da Injin Ingantaccen Maganganun Bayani Mai Kyau.

source: Want to change your voice clip?
ha: Kana son chanza muryar ka?

source: Want to help make Common Voice even better? Great! Get in touch via email or <discourseLink>Discourse</discourseLink> forums, submit site issues via <githubLink>GitHub</githubLink>, or join the <matrixLink>Matrix</matrixLink> community chat.
ha: Muna son taimakawa don sanya Common Voice koda mafi kyau?¶ Da kyau! Samun tuntuɓar mu ta imel ko <discourseLink> Jawabi </discourseLink>¶ tattaunawa, gabatar da al'amuran yanar gizo ta <githubLink> GitHub </githubLink>, ko shiga cikin¶ <matrixLink> Matrix </matrixLink> tattaunawa ta gari.

source: Want updates when we release a new version of the Common Voice dataset? Subscribe to our newsletter.
ha: Ana son ɗaukakawa lokacin da muka saki sabon sigar tsarin bayanan Murya? Biyan kuɗi zuwa wasikar labaranmu.

source: We are building an open and publicly available dataset of voices that everyone can use to train speech-enabled applications.
ha: Muna gina tarin bayanan muryoyin da kowa zai iya amfani dashi don horar da aikace-aikacen da suka dace da magana.

source: We at Mozilla are building a community around voice technology. We would like to stay in touch with updates, new data sources and to hear more about how you're using this data.
ha: Mu a Mozilla muna gina al'umma da suke da fasahar murya. Muna so mu ci gaba da tuntuɓa tare da sabunta sababbin bayanai kuma mu ji daga gareku kan yadda kuke amfani da wannan bayanan.

source: We believe that large and publicly available voice datasets foster innovation and healthy commercial competition in machine-learning based speech technology. This is a global effort and we invite everyone to participate. Our aim is to help speech technology be more inclusive, reflecting the diversity of voices from around the world.
ha: Mun yi imanin cewa babban bayanan bayanan murya da ke bayyane yana inganta bidi'a da gasa mai kyau na kasuwanci cikin fasahar magana ta hanyar ilmantarwa ta na'ura. Wannan ƙoƙari ne na duniya kuma muna gayyatar kowa da kowa ya shiga. Manufarmu ita ce taimaka wa fasahar magana ta zama mai haɗawa, don nuna bambancin muryoyi daga ko'ina cikin duniya.

source: We believe that large, publicly available voice datasets will foster innovation and healthy commercial competition in machine-learning based speech technology. Common Voice’s multi-language dataset is already the largest publicly available voice dataset of its kind, but it’s not the only one. Look to this page as a reference hub for other open source voice datasets and, as Common Voice continues to grow, a home for our release updates.
ha: Mun yi imanin cewa babban, wadatattun bayanan bayanan murya za su haɓaka bidi'a da ingantacciyar gasa ta kasuwanci cikin fasahar magana ta hanyar ilmantarwa ta fasaha.¶ ¶ Bayanan Yaren Common voice ya riga ya kasance mafi girman tarin samfuran bayanan murya na fili a cikin nau'inta, amma ba shi kaɗai ba.¶ ¶ Duba zuwa wannan shafin azaman matattarar bayanai na sauran bayanan muryar buɗe tushen bayanai kuma, yayin da Muryar gama gari ke ci gaba da haɓaka, gida don sabuntawar fitowar mu.

source: We calculate hours by estimating the average length of each recording, and then multiplying that number by the total number of recordings across all languages.
ha: Muna ƙididdige sa'o'i ta hanyar kimanta matsakaicin tsawon kowane rikodi, sa'annan mu ninka wannan lambar ta jimlar yawan rikodin a duk cikin yarukan.

source: We couldn’t find that page for you
ha: Ba mu iya nemo muku wannan shafin ba

source: Weekly
ha: Mako-mako

source: Weekly Goal
ha: Burin makon-mako

source: Welcome { $company } staff!
ha: Barka da zuwa { $company } ma'aikaci!

source: Welcome to Common Voice
ha: Barka da zuwa Common Voice

source: Welsh
ha: Yaren Welsh

source: We promise to handle your information with care. Read more in our <privacyLink>Privacy Notice</privacyLink>.
ha: Mun yi alkawari za mu kula da bayananku cikin kulawa. Karanta cikakken bayanai kan yadda muke <privacyLink>Kula da Sirrinku</privacyLink>

source: We’re building an open source, multi-language dataset of voices that anyone can use to train speech-enabled applications.
ha: Muna gina buɗaɗɗen tushe, tarin harsuna da yawa na muryoyin da kowa zai iya amfani da shi don horar da aikace-aikacen da suka dace da magana.
